<?php
/**
 * Created by PhpStorm.
 * User: Administrator
 * Date: 2019/5/12
 * Time: 11:27
 */

/*
 * dx190925 项目名称
 * winningRate 中奖率 可以是Int,Float或者Array 数组格式固定['target'=>XXX, 'other'=>XXX]
 * prizeDate 抽奖日期 可以是空值 Array ->['20190927', '20190928', '20190929']
 * prizeTime 抽奖时间 Array或者Int 小时  如果设置,会降低设置时间的中奖率 降低的中奖率为hotWinningRate
 * hotWinningRate 与winningRate保持一致
 * prizeArea 抽奖地区 String 省级或直辖市
 * 奖品配置
 * ['一等奖', '100元话费', 5, [10, 20, 30], [20, 40, 60]],
 * '一等奖'->奖品等级
 * '100元话费'->奖品
 * 100 ->cost 奖品标注(redis的key值)
 * 5->中奖权重
 * [10,20,30]->prizeArea地区奖品数量  10->'20190927'的数量...以此类推
 * [20,40,60]->除了prizeArea地区的奖品数量 20->'20190927'的数量...以此类推
 *
 * notPrize 如果只有一条不中奖状态可以不设置
 * ['not_prize', '未中奖',100,100000],
 * not_prize->prizeConf的key值
 * 未中奖->prize_name
 * 100->权重
 * 100000->数量
 * 不中奖   --未中奖/
 * 'notPirze' => ['prize_id' => 20, 'prize_level_name' => '未中奖', 'prize_name' => '未中奖', 'v' => 100, 'cost' => 0, 'count' => 0, 'limit' => 100000],
 * 不中奖   --奖品已发完/
 * 'afterPirze' => ['prize_id' => 21, 'prize_level_name' => '未中奖', 'prize_name' => '红包已发完', 'v' => 100, 'cost' => 0, 'count' => 0, 'limit' => 100000],
 * 不中奖数组  --发红包失败/
 * 'failSendpack' => ['prize_id' => 22, 'prize_level_name' => '未中奖', 'prize_name' => '红包发送失败', 'v' => 100, 'cost' => 0, 'count' => 0, 'limit' => 100000],
 * */
/*
return [
    'dx190925' => [
        'winningRate' => ['target' => 0.85, 'other' => 0.6], //中奖率
        'prizeDate' => ['20191114', '20191115', '20191116'],
        'prizeTime' => 10,
        'hotWinningRate' => ['target' => 0.6, 'other' => 0.4],
        'prizeArea' => '湖北',
        'prize' => [
            ['一等奖', '100元话费',100, 5, [10, 20, 30], [20, 40, 60]],
            ['二等奖', '50元话费',50, 15, [20, 40, 60], [20, 40, 60]],
            ['三等奖', '30元话费',30, 30, [40, 80, 100], [40, 80, 100]],
            ['四等奖', '10元话费',10, 50, [80, 150, 200], [80, 150, 200]]
        ],
        'notPrize' => [
            ['notPrize', '未中奖',100,100000],
            ['afterPrize', '奖品已发完',100,100000],
            ['failPrize', '奖品发送失败',100,100000]
        ],
    ]
];
*/
return [
    'dx190925' => [
        'winningRate' => 0.6, //中奖率
//        'prizeDate' => ['20191114', '20191115', '20191116'],
//        'prizeTime' => 10,
//        'hotWinningRate' => ['target' => 0.6, 'other' => 0.4],
//        'prizeArea' => '湖北',
        'prize' => [
            ['一等奖', '100元话费', 100, 5, 10],
            ['二等奖', '50元话费', 50, 15, 20],
            ['三等奖', '30元话费', 30, 30, 40],
            ['四等奖', '10元话费', 10, 50, 80]
        ],
//        'notPrize' => [
//            ['notPrize', '未中奖',100,100000],
//            ['afterPrize', '奖品已发完',100,100000],
//            ['failPrize', '奖品发送失败',100,100000]
//        ],
    ],

    'x191125' => [
        'winningRate' => ['target' => 0.8, 'other' => 0.25], //中奖率
        'prizeDate' => ['20191127', '20191128', '20191129'],
        'prizeArea' => '岳麓区',
        'prize' => [
            ['一等奖', '龙小湖雨伞', 1, 5, [3,1,1],[0,0,0]],
            ['二等奖', '茶颜悦色声声乌龙', 2, 15, [10,3,2],[0,0,0]],
            ['三等奖', '茶颜悦色幽兰拿铁', 3, 15, [15,4,2],[0,0,0]],
            ['四等奖', '果呀呀28元代金券', 4, 30, [13,8,6],[2,2,2]],
            ['五等奖', '果呀呀10元代金券', 5, 30, [35,8,2],[5,2,2]],
        ],
    ]
];
